MusicApp/app/models/user.rb

    def reset_session_token
        self.session_token = SecureRandom.urlsafe_base64
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mmurzRG0gYUme6VZR9WmTQ"], ["updated_at", "2022-07-06 19:59:01.054122"], ["id", 12]]